<?php

return [

    /**
     * Description for payment
     */
    'payment-description' => 'طلبك',
    'error-processing' => 'حدث خطأ أثناء معالجة طلبك. يرجى المحاولة مرة أخرى أو الاتصال بنا إذا استمر هذا الأمر.',

    /**
     * Statuses
     */
    'statuses' => [
        'paid' => 'مدفوع',
        'cancelled' => 'ألغيت',
        'new' => 'جديد',
    ],
    'status-messages' => [
        'paid' => 'شكرا لطلبك. لقد تلقيت رسالة تأكيد بالبريد الإلكتروني. سنخبرك عندما يتم إرسال طلبك.',
        'new' => 'تمت معالجة طلبك، لكن دفعتك لا تزال قيد المعالجة. ستتلقى رسالة تأكيد بالبريد الإلكتروني لطلبك بمجرد معالجة دفعتك بشكل صحيح (يحدث هذا عادةً تلقائيًا في غضون ساعتين). يرجى الاتصال إذا كان هذا يستغرق أكثر من بضع ساعات.',
        'cancelled' => 'أبلغ مزود الدفع أن الدفعة لم تتم. ولذلك تم إلغاء الطلب. لقد قمنا بحفظ سلة التسوق الخاصة بك، بحيث يمكنك بسهولة المحاولة مرة أخرى إذا حدث خطأ ما أو قمت بإلغاء الدفع عن طريق الخطأ.',
        'error' => 'حدث خطأ ما في دفعتك. يرجى الاتصال بنا للتحقق مما حدث. يرجى التأكد مما إذا كان المبلغ قد تم سحبه من حساب الدفع الخاص بك، وإدراج هذه المعلومات في رسالتك إلينا.',
    ],

    /**
     * CRUD
     */
    'crud' => [
        'singular' => 'order',
        'plural' => 'orders',
        'details' => 'تفاصيل',
        'payment-description' => 'شكرا لك على  :store_name order',
        'created_at' => [
            'label' => 'تم الانشاء',
        ],
        'order_no' => [
            'label' => 'رقم الطلب.',
        ],
        'full_address' => [
            'label' => 'عنوان',
        ],
        'order_items' => [
            'label' => 'منتجات',
        ],
        'order_total' => [
            'label' => 'المجموع',
        ],
        'status' => [
            'label' => 'حالة',
        ],
    ],

    /**
     * Details
     */
    'details' => [
        'title' => 'طلب (:order_no)',
        'phone' => 'رقم الهاتف.',
        'address' => 'عنوان',
        'invoice_no' => 'رقم الفاتورة.',
        'invoice_date' => 'تاريخ',
        'order_summary' => 'ملخص الطلب',
        'excl_vat' => 'غير شامل. ضريبة القيمة المضافة',
        'vat' => 'ضريبة القيمة المضافة',
        'incl_vat' => 'بما في ذلك ضريبة القيمة المضافة',
        'subtotal' => 'المجموع الفرعي',
        'shipping' => 'شحن',
        'total' => 'المجموع',
        'status' => 'حالة الطلب: :status',
    ],
];
