<?php

return [

    /**
     * CRUD
     */
    'crud' => [
        'singular' => 'shipping rule',
        'plural' => 'shipping rules',
        'shipping_region_id' => [
            'label' => 'منطقة الشحن',
        ],
        'shipping_size_id' => [
            'label' => 'حجم الشحن',
        ],
        'max_weight' => [
            'label' => 'الأعلى. وزن',
            'suffix' => 'جرامات',
        ],
        'price' => [
            'label' => 'رسوم الشحن',
        ],
        'vat_class_id' => [
            'label' => 'فئة ضريبة القيمة المضافة',
            'hint' => 'إذا تم تحديدها، فإن هذا يلغي فئة ضريبة القيمة المضافة لجميع المنتجات في عربة التسوق. قد يكون هذا مفيدًا عندما يتطلب الشحن الدولي إلى هذه المنطقة ضريبة القيمة المضافة بنسبة 0% على سبيل المثال.',
        ],
        'shipping_vat_class_id' => [
            'label' => 'فئة ضريبة القيمة المضافة للشحن',
            'hint' => 'نسبة ضريبة القيمة المضافة التي سيتم تطبيقها على رسوم الشحن.',
        ],
    ],


    /**
     * Request / validation
     */
    'request' => [
        'shipping_region_id' => [
            'required' => 'لم تقم بتحديد منطقة الشحن التي تنطبق عليها هذه القاعدة.',
            'exists' => 'منطقة الشحن هذه غير موجودة (أو لم تعد) موجودة في قاعدة البيانات.',
        ],
        'shipping_size_id' => [
            'required_if' => 'لم تقم بتحديد حجم الشحن.',
            'exists' => 'حجم الشحن غير موجود (أو لم يعد) موجودًا في قاعدة البيانات.',
        ],
        'max_weight' => [
            'required_if' => 'لم تقم بإدخال الحد الأقصى للوزن لقاعدة الشحن هذه.',
        ],
        'price' => [
            'required' => 'لم تقم بإدخال رسوم الشحن (0 لا بأس به أيضًا).',
        ],
        'vat_class_id' => [
            'exists' => 'فئة ضريبة القيمة المضافة التي حددتها كتجاوز لقاعدة الشحن هذه غير موجودة (أو لم تعد) موجودة في قاعدة البيانات.',
        ],
        'shipping_vat_class_id' => [
            'required_unless' => 'لم تقم بتحديد فئة ضريبة القيمة المضافة التي سيتم تطبيقها على رسوم الشحن.',
            'exists' => 'فئة ضريبة القيمة المضافة التي حددتها للشحن غير موجودة (أو لم تعد) موجودة في قاعدة البيانات.',
        ],
    ],
];
